



class AiConstant {
  static List<String> triviaList = [
    '公猫也有乳头',
    '猫一生中百分之七十都在睡觉',
    '猫能够认出主人的声音',
    '猫通常是右撇子，公猫则是左撇子',
    '牛顿发明了猫门',
    '可以单独操控每只耳朵',
    '猫换牙时通常会直接将乳牙吞入肚子',
    '猫一年有两次的换毛期，是为了适应夏天、冬天的气候',
    '猫的大脑储存量是 iPad 的一千倍',
    '猫咪尝不出甜味',
    '猫咪的弹跳最高可达自身六倍',
    '大部分刚出生的猫咪眼睛都是蓝色的',
    '猫咪是爱打呵欠的生物',
    '猫咪全身都有汗腺但并没有很发达',
    '猫咪喝水慢，一般舔 3-4 口，只会咽下 1 口'
  ];

  static List<String> fateList = [
  '''积极乐观篇
今日运势提示：积极面对挑战，乐观的态度将为你开启新的可能。小小的努力今天可能会带来意想不到的收获。保持笑容，好运自然来！''', '''
机遇挑战篇
今天的你将遇到既刺激又充满机遇的一天。在职场上可能会有新的挑战，但别忘了这也是成长的机会。把握今天，展现你的能力和魅力吧！''', '''
爱情运势篇
爱情运势上升，今天是表达感情的好日子。无论是深入交流还是浪漫约会，都有机会拉近彼此的距离。勇敢表达你的爱，可能会有惊喜哦！''', '''
健康关注篇
今日提醒：注重个人健康。适当的运动和均衡的饮食是保持活力的关键。不要忽视身体的小信号，及时休息，保持良好的生活习惯。''', '''
财运指南篇
财运今日有小幅上升，适合进行一些小额投资。但记得，理财需谨慎，避免贪心。合理规划你的开支，稳健理财将带来意外的回报。'''
  ];

  static List<String> testResultList = [
    '''屬於你的貓咪品種是：
白色（a）： 波斯猫，土耳其安哥拉猫''','''屬於你的貓咪品種是：
橘色（b）： 橘猫，英国短毛猫''','''屬於你的貓咪品種是：
灰色（c）： 俄罗斯蓝猫，英国蓝猫''','''屬於你的貓咪品種是：
斑点/花纹（d）： 豹猫，孟买猫'''
  ];
}