
// 參考規格
// https://o411cvvunt4.sg.larksuite.com/sheets/HtnpsDQIwhCRFztHX8BlCk22gwh?sheet=jlE0CZ

List<String> fundHistoryType = [
  '视频消耗',
  '视频免费',
  '语音消耗',
  '语音免费',
  '文字消耗',
  '文字免费',
  '礼物消耗', // 顯示禮物 ICON
  '背包礼物消耗', // 顯示禮物 ICON
  '充值赠送金币',
  '签到赠送', // 顯示禮物 ICON
  '活动赠送',
  '充值金币',
  '退回金币',
  '积分兑换金币',
  '注册奖励', // 顯示禮物 ICON
  '邀请奖励积分(充值)',
  '邀请奖励积分(收益)',
  '视频收益',
  '视频免费',
  '语音收益',
  '语音免费',
  '文字收益',
  '文字免费',
  '礼物收益',
  '背包礼物收益',
  '活动积分收益',
  '积分兑换金币',
  '提现积分',
  '提现失败',
  '人工减金币',
  '推广结算积分',
  '首充赠送礼物',
  '首充赠送金币',
  '动态打赏消耗',
  '动态打赏收益'
];

class FundHistoryCodeMapping {
  final Map<int, String> typeMap = {
    0: '视频消耗',
    1: '视频免费',
    2: '语音消耗',
    3: '语音免费',
    4: '文字消耗',
    5: '文字免费',
    6: '礼物消耗',
    7: '背包礼物消耗',
    8: '充值赠送金币',
    9: '签到赠送',
    10: '活动赠送',
    11: '充值金币',
    12: '退回金币',
    13: '积分兑换金币',
    14: '注册奖励',
    15: '邀请奖励积分(充值)',
    16: '邀请奖励积分(收益)',
    17: '视频收益',
    18: '视频免费',
    19: '语音收益',
    20: '语音免费',
    21: '文字收益',
    22: '文字免费',
    23: '礼物收益',
    24: '背包礼物收益',
    25: '活动积分收益',
    26: '积分兑换金币',
    27: '提现积分',
    28: '提现失败',
    29: '人工减金币',
    30: '推广结算积分',
    31: '首充赠送礼物',
    32: '首充赠送金币',
    33: '动态打赏消耗',
    34: '动态打赏收益'
  };

  String getTypeText(int fundHistoryCode) {
    return typeMap[fundHistoryCode] ?? "未知类型";
  }
}